---
kind: property
id: P:Autodesk.Revit.DB.BarTypeDiameterOptions.BarModelDiameter
source: html/c72159be-877e-14e0-5778-7a00c3215b2f.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.BarModelDiameter Property

Represents the bar model diameter of the RebarBarType.

## Syntax (C#)
```csharp
public double BarModelDiameter { get; set; }
```